In [1]:
import pandas as pd

In [2]:
s = pd.Series([9904312, 3448737, 2890451, 2466052],
              index=["서울", "부산", "인천", "대구"])

In [3]:
s[[0,3,1]]

서울    9904312
대구    2466052
부산    3448737
dtype: int64

In [4]:
s[["서울", "대구", "부산"]]

서울    9904312
대구    2466052
부산    3448737
dtype: int64

In [5]:
s.서울

9904312

In [6]:
s.대구

2466052

In [7]:
 s[1:3]

부산    3448737
인천    2890451
dtype: int64

In [8]:
"서울" in s

True

In [9]:
for k, v in s.items():
    print(f"{k}={v}")

서울=9904312
부산=3448737
인천=2890451
대구=2466052

In [10]:
인구_2015 = pd.Series([9904312, 3448737, 2890451, 2466052],
              index=["서울", "부산", "인천", "대구"])
인구_2010 = pd.Series({"서울": 9631482, "부산": 3393191, "인천": 2632035, "대전": 1490158})

In [11]:
인구_2015-인구_2010

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [12]:
인구_2015.values-인구_2010.values

array([272830,  55546, 258416, 975894], dtype=int64)

In [13]:
ds = 인구_2015-인구_2010
ds[ds.notnull()]

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [14]:
s = pd.Series([9904312, 3448737, 2890451, 2466052],
              index=["서울", "부산", "인천", "대구"])
s['부산'] = 9900000
del s['서울']
s

부산    9900000
인천    2890451
대구    2466052
dtype: int64

In [15]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [16]:
df["2010-2015 증가율"] = df["2010-2015 증가율"] * 100
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [17]:
df["2005-2010 증가율"] = ((df["2010"] - df["2005"]) / df["2005"] * 100).round(2)
df

     지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
서울  수도권  9904312  9631482  9762546  9853972           2.83          -1.34
부산  경상권  3448737  3393191  3512547  3655437           1.63          -3.40
인천  수도권  2890451  2632035  2517680  2466338           9.82           4.54
대구  경상권  2466052  2431774  2456016  2473990           1.41          -0.99

In [18]:
df["지역"]

서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [19]:
type(df["지역"])

pandas.core.series.Series

In [20]:
df[['2010','2015']]

       2010     2015
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [21]:
type(df[['2010','2015']])

pandas.core.frame.DataFrame

In [22]:
df[:1]

     지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
서울  수도권  9904312  9631482  9762546  9853972           2.83          -1.34

In [23]:
df['서울':'서울']

     지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
서울  수도권  9904312  9631482  9762546  9853972           2.83          -1.34

In [24]:
df[1:3]

     지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
부산  경상권  3448737  3393191  3512547  3655437           1.63          -3.40
인천  수도권  2890451  2632035  2517680  2466338           9.82           4.54

In [25]:
df["부산":"인천"]

     지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
부산  경상권  3448737  3393191  3512547  3655437           1.63          -3.40
인천  수도권  2890451  2632035  2517680  2466338           9.82           4.54

In [28]:
df["2015"]["서울"]

9904312

In [29]:
import numpy as np

In [30]:
df = pd.DataFrame(np.arange(10, 22).reshape(3, 4),
                  index=["a", "b", "c"],
                  columns=["A", "B", "C", "D"])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [32]:
df.loc["a"]

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [33]:
df.loc["b":"c"]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [35]:
df.loc[["b","c"]]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [36]:
df.loc[:,"A"]

a    10
b    14
c    18
Name: A, dtype: int32

In [37]:
df.A > 15

a    False
b    False
c     True
Name: A, dtype: bool

In [38]:
df.loc[df.A>15]

    A   B   C   D
c  18  19  20  21

In [39]:
df.A

a    10
b    14
c    18
Name: A, dtype: int32

In [40]:
df.loc['a','B']

11

In [47]:
type(df.loc["b", :])

pandas.core.series.Series

In [48]:
df.iloc[0,1]

11

In [49]:
df.iloc[-1] = df.iloc[-1] * 2

In [58]:
df.iloc[:,0]>10

a    False
b     True
c     True
Name: A, dtype: bool

In [68]:
df.iloc[list(df.iloc[:,0]>10), [2,3]]

    C   D
b  16  17
c  40  42

In [69]:
df.loc[df.A > 10, ["C", "D"]]

    C   D
b  16  17
c  40  42

    A   B   C   D
b  14  15  16  17
c  36  38  40  42

In [70]:
df.iloc[df.iloc[] > 10, ["C", "D"]]

SyntaxError: invalid syntax. Perhaps you forgot a comma? (42515933.py, line 1)

In [71]:
df = pd.DataFrame({
    'A': [1, 3, 4, 3, 4],
    'B': [2, 3, 1, 2, 3],
    'C': [1, 5, 2, 4, 4]
})

In [72]:
df.apply(lambda x: x.max() - x.min())

A    3
B    2
C    4
dtype: int64

In [78]:
f = lambda x: max(x) - min(x)

In [79]:
f([1,2,3])

2

In [80]:
df.apply(f)

A    3
B    2
C    4
dtype: int64

In [81]:
df

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [82]:
df.apply(lambda x: x.max() - x.min(), axis=1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [83]:
df.apply(pd.value_counts)

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [84]:
!pip install seaborn

Collecting seaborn
  Downloading seaborn-0.12.1-py3-none-any.whl (288 kB)
     -------------------------------------- 288.2/288.2 KB 9.0 MB/s eta 0:00:00
Requirement already satisfied: numpy>=1.17 in c:\users\kwanw\desktop\dev\effectivepython\venv\lib\site-packages (from seaborn) (1.23.5)
Requirement already satisfied: pandas>=0.25 in c:\users\kwanw\desktop\dev\effectivepython\venv\lib\site-packages (from seaborn) (1.5.2)
Collecting matplotlib!=3.6.1,>=3.1
  Downloading matplotlib-3.6.2-cp310-cp310-win_amd64.whl (7.2 MB)
     ---------------------------------------- 7.2/7.2 MB 51.1 MB/s eta 0:00:00
Requirement already satisfied: pyparsing>=2.2.1 in c:\users\kwanw\desktop\dev\effectivepython\venv\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (3.0.9)
Collecting kiwisolver>=1.0.1
  Downloading kiwisolver-1.4.4-cp310-cp310-win_amd64.whl (55 kB)
     ---------------------------------------- 55.3/55.3 KB ? eta 0:00:00
Collecting pillow>=6.2.0
  Using cached Pillow-9.3.0-cp310-cp310-win_amd64.whl (2.5 MB)
Requirement already satisfied: packaging>=20.0 in c:\users\kwanw\desktop\dev\effectivepython\venv\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (21.3)
Collecting cycler>=0.10
  Downloading cycler-0.11.0-py3-none-any.whl (6.4 kB)
Collecting fonttools>=4.22.0
  Downloading fonttools-4.38.0-py3-none-any.whl (965 kB)
     ------------------------------------- 965.4/965.4 KB 59.7 MB/s eta 0:00:00
Requirement already satisfied: python-dateutil>=2.7 in c:\users\kwanw\desktop\dev\effectivepython\venv\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (2.8.2)
Collecting contourpy>=1.0.1
  Downloading contourpy-1.0.6-cp310-cp310-win_amd64.whl (163 kB)
     ---------------------------------------- 163.6/163.6 KB ? eta 0:00:00
Requirement already satisfied: pytz>=2020.1 in c:\users\kwanw\desktop\dev\effectivepython\venv\lib\site-packages (from pandas>=0.25->seaborn) (2022.6)
Requirement already satisfied: six>=1.5 in c:\users\kwanw\desktop\dev\effectivepython\venv\lib\site-packages (from python-dateutil>=2.7->matplotlib!=3.6.1,>=3.1->seaborn) (1.16.0)
Installing collected packages: pillow, kiwisolver, fonttools, cycler, contourpy, matplotlib, seaborn
Successfully installed contourpy-1.0.6 cycler-0.11.0 fonttools-4.38.0 kiwisolver-1.4.4 matplotlib-3.6.2 pillow-9.3.0 seaborn-0.12.1

WARNING: You are using pip version 22.0.4; however, version 22.3.1 is available.
You should consider upgrading via the 'C:\Users\kwanw\Desktop\dev\effectivepython\venv\Scripts\python.exe -m pip install --upgrade pip' command.

In [85]:
import seaborn as sns

In [86]:
titanic = sns.load_dataset('titanic')

In [87]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [92]:
f= lambda r: "adult" if r.age >= 20 else "child"
titanic["adult/child"] = titanic.apply(f, axis=1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult

In [94]:
df.apply(pd.value_counts).fillna(0.0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [95]:
df.apply(pd.value_counts).fillna(0.0).astype(int)

   A  B  C
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1